pmo-dataset/variations/graphviz_with_ids/21.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Insure parcel"];
  "Task_2" [label="Write package label"];
  "Task_3" [label="Clarify shipment\nmethod"];
  "Task_4" [label="Get 3 offers from\nlogistic companies"];
  "Task_5" [label="Select logistic\ncompany and place\norder"];
  "Task_6" [label="Package goods"];
  "Task_7" [label="Prepare for picking\nup goods"];
  "StartNoneEvent_1" [shape=circle, label="Ship goods"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Shipment prepared"];
  "ExclusiveGateway_1" [shape=diamond, label="Special sandling?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "InclusiveGateway_1" [shape=diamond, label="O"];
  "InclusiveGateway_2" [shape=diamond, label="O"];

  "ExclusiveGateway_1" -> "InclusiveGateway_1" [label="no"];
  "InclusiveGateway_1" -> "Task_1" [label="If insurance\nnecessary"];
  "InclusiveGateway_1" -> "Task_2" [label="always"];
  "Task_2" -> "InclusiveGateway_2";
  "Task_1" -> "InclusiveGateway_2";
  "StartNoneEvent_1" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Task_3";
  "Task_3" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Task_4" [label="yes"];
  "Task_4" -> "Task_5";
  "Task_5" -> "ExclusiveGateway_2";
  "InclusiveGateway_2" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3";
  "Task_6" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Task_7";
  "Task_7" -> "EndNoneEvent_1";
  "ParallelGateway_1" -> "Task_6";

  subgraph "cluster_Pool_1" {
    label="Dispatch of goods\nComputer Hardware\nShop";

    subgraph "cluster_Lane_1" {
      label="Logistics";
      "Task_1";
    }

    subgraph "cluster_Lane_2" {
      label="Secretary";
      "Task_2";
      "Task_3";
      "Task_4";
      "Task_5";
      "InclusiveGateway_1";
      "InclusiveGateway_2";
      "StartNoneEvent_1";
      "ParallelGateway_1";
      "ExclusiveGateway_1";
      "ExclusiveGateway_2";
    }

    subgraph "cluster_Lane_3" {
      label="Warehouse";
      "Task_6";
      "Task_7";
      "ExclusiveGateway_3";
      "EndNoneEvent_1";
    }
  }
}
